# একটি বার চার্ট ডেটা কল্পনা করতে আয়তক্ষেত্রাকার বার ব্যবহার করে। বার চার্ট অনুভূমিকভাবে বা উল্লম্বভাবে প্রদর্শিত হতে পারে। বারগুলির উচ্চতা বা দৈর্ঘ্য তাদের প্রতিনিধিত্ব করা মানগুলির সমানুপাতিক।
# barplot()একটি উল্লম্ব বার চার্ট আঁকতে ফাংশনটি ব্যবহার করুন :

# ! x-axis values
mylabel <- c("Apples", "Bananas", "Cherries", "Dates")

# y-axis values
y <- c(10, 20, 30, 40)

# ! বার রঙ
colors <- c("blue", "yellow", "green", "black")

# !ঘনত্ব / বার টেক্সচার (Density / Bar Texture)
# বার টেক্সচার পরিবর্তন করতে, density প্যারামিটার ব্যবহার করুন:
# !বার প্রস্থ
# widthবারের প্রস্থ পরিবর্তন করতে পরামিতি ব্যবহার করুন :


barplot(
    y,
    names.arg = mylabel,
    col = colors,
    density = 10,
    width = c(1:4)
)
# !অনুভূমিক বার
# আপনি যদি বারগুলি উল্লম্বভাবে পরিবর্তে অনুভূমিকভাবে প্রদর্শন করতে চান তবে ব্যবহার করুন horiz=TRUE:

barplot(
    y,
    names.arg = mylabel,
    col = colors,
    density = 10,
    horiz = TRUE,
    height = c(1:4)
)

# চলকটি xx-অক্ষে (A, B, C, D) মানগুলিকে উপস্থাপন করে
# ভেরিয়েবলটি yy-অক্ষের মানগুলিকে উপস্থাপন করে (2,4,6,8)
# তারপর আমরা barplot()মানগুলির একটি বার চার্ট তৈরি করতে ফাংশনটি ব্যবহার করি
# names.argx - অক্ষে প্রতিটি পর্যবেক্ষণের নাম সংজ্ঞায়িত করে
