# ডেটা সেট
# একটি ডেটা সেট হল ডেটার একটি সংগ্রহ, যা প্রায়শই একটি টেবিলে উপস্থাপিত হয়।

# R-এ একটি জনপ্রিয় অন্তর্নির্মিত ডেটা সেট রয়েছে যাকে " mtcars " (মোটর ট্রেন্ড কার রোড টেস্ট) বলা হয়, যা 1974 সালের মোটর ট্রেন্ড ইউএস ম্যাগাজিন থেকে সংগ্রহ করা হয়েছে।

# নীচের উদাহরণগুলিতে (এবং পরবর্তী অধ্যায়গুলির জন্য), আমরা mtcars পরিসংখ্যানগত উদ্দেশ্যে ডেটা সেট ব্যবহার করব:
mpg <- mtcars[[2]]
nameMpg <- mtcars[1]

Data_Frame <- data.frame(
    Pulse = c(100, 150, 120),
    Duration = c(60, 30, 45)
)
# ! Information About the Data Set
# ডেটা সেট সম্পর্কে তথ্য পেতে আপনি প্রশ্ন চিহ্ন ( ) ব্যবহার করতে পারেন mtcars:
# print(?mtcars)
# !dim()ডেটা সেটের মাত্রা খুঁজে পেতে ফাংশনটি ব্যবহার করুন এবং names()ভেরিয়েবলের নাম দেখতে ফাংশনটি ব্যবহার করুন:
Data_Cars <- mtcars

# Use dim() to find the dimension of the data set
# dim(Data_Cars)

# # Use names() to find the names of the variables from the data set
# names(Data_Cars)

# !প্রথম কলামে প্রতিটি সারির নাম পেতে ফাংশনটি ব্যবহার করুন rownames(), যা প্রতিটি গাড়ির নাম:
# rownames(Data_Cars)

# !পরিবর্তনশীল মান প্রিন্ট করুন
# আপনি যদি ভেরিয়েবলের সাথে সম্পর্কিত সমস্ত মান মুদ্রণ করতে চান তবে সাইন ব্যবহার করে ডেটা ফ্রেম অ্যাক্সেস করুন $এবং ভেরিয়েবলের নাম (উদাহরণস্বরূপ cyl(সিলিন্ডার)):

Data_Cars$cyl

# পরিবর্তনশীল মান সাজান
Data_Cars <- mtcars
sort(Data_Cars$cyl)

# ! তথ্য বিশ্লেষণ
summary(Data_Cars)
# ফাংশনটি summary()প্রতিটি ভেরিয়েবলের জন্য ছয়টি পরিসংখ্যানগত সংখ্যা প্রদান করে:
# মিন
# প্রথম কোয়ান্টাইল (শতাংশ)
# মধ্যমা
# মানে
# তৃতীয় কোয়ান্টাইল (শতাংশ)
# সর্বোচ্চ
